// Написать программу, которая из массива users
// удалит имена длиной 5 и меньше символов
// Добавит их в массив shortNames
const users = ['Jack', 'Mariah', 'Sarah', 'Jonathan', 'Piere', 'Bob', 'Samantha', 'Mary'];
const shortNames = [];



// Написать программу которая каждое число
// умножит на 3 и определит чётное оно или нет
// выводит в консоль число и чётное оно или нечётное
// пример: 6 is even
const numbers = [2, 23, 15, 16, 12, 8, 25, 5];



// Написать программу которая из данного объекта
// Выведет строку в консоль: 
// Hello Jack Smith. You are 34 years old. Your salary is 1500 eur.
const userProfile = {
    userName: 'Jack',
    userSurname: 'Smith',
    userAge: 34,
    userSalary: 1500
}



// Написать программу которая проверяет чётное число или нет
// Если число чётное то выводит в консоль число умноженое на два
// Если число нечётное то выводит в консоль число умноженое на три
const numbers2 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];



// people это массив элементами которого являются объекты
// написать программу которая проверит возраст каждого человека
// если младше 15 лет выводит ИМЯ is child
// если младше 18 и старше 14 то ИМЯ is teenager
// если 18 и старше то ИМЯ is adult
const people = [{userName: 'Jack', age: 18}, {userName: 'Mary', age: 20}, {userName: 'Bob', age: 12}, {userName: 'Gary', age: 40}, {userName: 'Sarah', age: 17}];
